import os

DISCORD_TOKEN = os.getenv("DISCORD_TOKEN")
POLLINATIONS_KEY = os.getenv("POLLINATIONS_KEY")
AGENT_ID = "community/FakGrak-gif/arena-bot" 

CHANNEL_ID_1 = 1563607580406710473 # Обычное казино
CHANNEL_ID_2 = 1564183939495624764 # VIP казино
ARENA_CHANNEL_ID = 1564187640805458002 # Канал для Арены
WORK_CHANNEL_ID = 1564224730217582623 # Канал для работы

SHOP_ITEMS = {
    "1": ("Кейс в кс2", 50, "🛒 Куплено: Кейс КС2"),
    "2": ("Сменить цвет ника", 60, "🛒 Куплено: Цвет ника"),
    "3": ("Похвала от админа", 70, "🛒 Куплено: Похвала"),
    "4": ("Скин в кс2 (дешевый)", 120, "🛒 Куплено: Скин КС2"),
    "5": ("Своя роль", 200, "🛒 Куплено: Кастомная роль"),
    "6": ("Право отправлять сообщение с озвучкой", 250, "🛒 Куплено: Озвучка"),
    "7": ("Скин в кс2 (дорогой)", 400, "🛒 Куплено: Дорогой скин"),
    "8": ("Личный канал", 500, "🛒 Куплено: Личный канал"),
    "9": ("Право перемещать участников", 600, "🛒 Куплено: Мув"),
    "10": ("Право глушить людей", 800, "🛒 Куплено: Мут"),
    "11": ("Право кикать людей", 1200, "🛒 Куплено: Кик"),
    "12": ("Судья", 2000, "🛒 Куплено: Судья"),
    "13": ("Роль админа", 4000, "🛒 Куплено: Админ"),
}

ARENA_REWARDS = {1: 1, 2: 1, 3: 2, 4: 2, 5: 3, 6: 4, 7: 5, 8: 6, 9: 7, 10: 9}